Core/src/Catalogs/НаправленияДеятельности/НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияДеятельности</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеНаправление</name>
      <description>Основное направление</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетУчетаВыручкиОтПродаж</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСебестоимостиПродаж</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПрибыли</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВыручкиОтПродажРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСебестоимостиПродажРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПрибылиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.АналитикаДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/НаправленияДеятельности/Forms/ФормаРедактированияСчетовУчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетУчетаВыручкиОтПродаж = Параметры.СчетУчетаВыручкиОтПродаж;
	СчетУчетаСебестоимостиПродаж = Параметры.СчетУчетаСебестоимостиПродаж;
	СчетУчетаПрибыли = Параметры.СчетУчетаПрибыли;
	СчетУчетаВыручкиОтПродажРегл = Параметры.СчетУчетаВыручкиОтПродажРегл;
	СчетУчетаСебестоимостиПродажРегл = Параметры.СчетУчетаСебестоимостиПродажРегл;
	СчетУчетаПрибылиРегл = Параметры.СчетУчетаПрибылиРегл;
	НаправлениеДеятельности = Параметры.Ссылка;
	
	Если ОтказИзменитьСчетаУчета(НаправлениеДеятельности) Тогда
		Элементы.ГруппаСчетовУчета.Подсказка = НСтр("ka='ბაზაში არის საქმიანობის ამ მიმართულებასთან დაკავშირებული შემოსავლები ან ხარჯები! გაყიდვებიდან მიღებული ნავაჭრის აღრიცხვის ანგარიშის შეცვლა აკრძალულია!';ru='В базе есть доходы или расходы по этому направлению деятельности! Изменение счета учета выручки от продаж запрещено!';en='The database has a gain or loss on this activity! Changing accounts accounting of proceeds from sales is forbidden!'");
		Элементы.ГруппаСчетовУчета.Доступность = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Ссылка = Справочники.НаправленияДеятельности.Прочее Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета", Перечисления.ТипыСчетов.ПрочиеДоходы);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СчетУчетаВыручкиОтПродаж.ПараметрыВыбора = НовыеПараметры;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета", Перечисления.ТипыСчетов.ПрочиеРасходы);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СчетУчетаСебестоимостиПродаж.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета", Перечисления.ТипыСчетов.Доходы);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СчетУчетаВыручкиОтПродаж.ПараметрыВыбора = НовыеПараметры;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета", Перечисления.ТипыСчетов.СебестоимостьПродаж);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СчетУчетаСебестоимостиПродаж.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли;
	
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаВыручкиОтПродажПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродаж) Тогда
	//	СчетУчетаВыручкиОтПродаж = ПредопределенноеЗначение("ПланСчетов.Управленческий.ВыручкаОтПродаж");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаСебестоимостиПродажПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаСебестоимостиПродаж) Тогда
	//	СчетУчетаСебестоимостиПродаж = ПредопределенноеЗначение("ПланСчетов.Управленческий.СебестоимостьПродаж");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПрибылиПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаПрибыли) Тогда
	//	СчетУчетаПрибыли = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетУчетаВыручкиОтПродаж = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаСебестоимостиПродаж = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаПрибыли = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры // ПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет возможность изменения счета.
//
&НаСервере
Функция ОтказИзменитьСчетаУчета(НаправлениеДеятельности)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Регистратор,
	|	ДоходыИРасходы.НомерСтроки,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.СуммаДоходов,
	|	ДоходыИРасходы.СуммаРасходов,
	|	ДоходыИРасходы.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	|ГДЕ
	|	ДоходыИРасходы.НаправлениеДеятельности = &НаправлениеДеятельности");
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетУчетаВыручкиОтПродаж()

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетов()
	
	СтруктураПараметры = Новый Структура(
		"СчетУчетаВыручкиОтПродаж, СчетУчетаСебестоимостиПродаж, СчетУчетаПрибыли, СчетУчетаВыручкиОтПродажРегл, СчетУчетаСебестоимостиПродажРегл, СчетУчетаПрибылиРегл",
		СчетУчетаВыручкиОтПродаж, СчетУчетаСебестоимостиПродаж, СчетУчетаПрибыли, СчетУчетаВыручкиОтПродажРегл, СчетУчетаСебестоимостиПродажРегл, СчетУчетаПрибылиРегл
	);
	
	Оповестить("ИзменилисьСчетаНаправленияДеятельности", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаВыручкиОтПродажРеглПриИзменении(Элемент)
	
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаВыручкиОтПродажРегл, СчетУчетаВыручкиОтПродаж);
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПрибылиРеглПриИзменении(Элемент)
	
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаПрибылиРегл, СчетУчетаПрибыли);
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаСебестоимостиПродажРеглПриИзменении(Элемент)
	
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаСебестоимостиПродажРегл, СчетУчетаСебестоимостиПродаж);
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

#КонецОбласти
